Versión loopBack/AplicacionTuLibroOnline/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ven="http://j2ee.netbeans.org/wsdl/ServiciosVenta/src/VentaLibrosWSDL">
  <soapenv:Body>
    <ven:VentaLibrosWSDLOperation>
      <ISBN>dfg</ISBN>
      <idCliente>sd</idCliente>
      <unidades>22</unidades>
      <precioUnidad>10</precioUnidad>
    </ven:VentaLibrosWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>